In [68]:
import pandas as pd
import numpy as np

In [69]:
technologies = ({
  'Courses':["Spark","PySpark","Hadoop","Python","pandas","Oracle","Java"],
  'Fee' :[20000,25000,26000,22000,24000,21000,22000],
  'Duration':['30day', '40days' ,'35days', '40days', '60days', '50days', '55days']
              })
df = pd.DataFrame(technologies)
df

   Courses    Fee Duration
0    Spark  20000    30day
1  PySpark  25000   40days
2   Hadoop  26000   35days
3   Python  22000   40days
4   pandas  24000   60days
5   Oracle  21000   50days
6     Java  22000   55days

**to_csv()**

In [70]:
# to_csv() - allows you to save a Pandas DataFrame as a CSV file

df.to_csv('data505.csv', encoding = 'utf-8')

In [71]:
df.to_csv(r'~/Documents/github/rajiv-ranjan/cds-nov-02-03/Practice - Numpy, Pandas, Matplotlib/In_Class_Notebook_November, 03, 2024/data504.csv', encoding = 'utf-8')

In [72]:
df.to_csv('data506.csv', index=False, encoding = 'utf-8')

In [73]:
#!pip install openpyxl

In [74]:
# Write DataFrame to Excel file

new_file_name = r'NewCourses507.xlsx'

df.to_excel(new_file_name, index=False)

In [75]:
# Write DataFrame to Excel file with a sheet-name

new_file_name = r'NewCourses508.xlsx'

df.to_excel(new_file_name, index=False, sheet_name = 'TechData')

### iloc, loc - Select Rows by Index (Position/Label)

- Use pandas DataFrame.iloc[] & DataFrame.loc[] to select rows by integer Index and by row indices respectively.
- When using .iloc[] or loc[] with an **index that doesnâ€™t exist it returns an error**.

**iloc**

In [76]:
# select rows and cols by int index - iloc

In [77]:
technologies = {
    'Courses':["Spark","PySpark","Hadoop","Python","pandas","Oracle","Java"],
    'Fee' :[20000,25000,26000,22000,24000,21000,22000],
    'Duration':['30days','40days','35days','40days',np.nan,None,'55days'],
    'Discount':[1000,2300,1500,1200,2500,2100,2000]
               }
index_labels=['r1','r2','r3','r4','r5','r6','r7']

df = pd.DataFrame(technologies, index = index_labels)
df

    Courses    Fee Duration  Discount
r1    Spark  20000   30days      1000
r2  PySpark  25000   40days      2300
r3   Hadoop  26000   35days      1500
r4   Python  22000   40days      1200
r5   pandas  24000      NaN      2500
r6   Oracle  21000     None      2100
r7     Java  22000   55days      2000

In [78]:
df.iloc[2]

Courses     Hadoop
Fee          26000
Duration    35days
Discount      1500
Name: r3, dtype: object

In [79]:
df.iloc[2:]

   Courses    Fee Duration  Discount
r3  Hadoop  26000   35days      1500
r4  Python  22000   40days      1200
r5  pandas  24000      NaN      2500
r6  Oracle  21000     None      2100
r7    Java  22000   55days      2000

In [80]:
df.iloc[2::2]

   Courses    Fee Duration  Discount
r3  Hadoop  26000   35days      1500
r5  pandas  24000      NaN      2500
r7    Java  22000   55days      2000

In [81]:
df.iloc[[2,4,6]]

   Courses    Fee Duration  Discount
r3  Hadoop  26000   35days      1500
r5  pandas  24000      NaN      2500
r7    Java  22000   55days      2000

In [82]:
df.iloc[::, 0:3]

    Courses    Fee Duration
r1    Spark  20000   30days
r2  PySpark  25000   40days
r3   Hadoop  26000   35days
r4   Python  22000   40days
r5   pandas  24000      NaN
r6   Oracle  21000     None
r7     Java  22000   55days

In [83]:
df.shape

(7, 4)

In [84]:
df.iloc[1:6:2, :]

    Courses    Fee Duration  Discount
r2  PySpark  25000   40days      2300
r4   Python  22000   40days      1200
r6   Oracle  21000     None      2100

**loc**
- loc is **label based**, so we have to specify rows and columns based on their index/row and column labels.

In [85]:
df

    Courses    Fee Duration  Discount
r1    Spark  20000   30days      1000
r2  PySpark  25000   40days      2300
r3   Hadoop  26000   35days      1500
r4   Python  22000   40days      1200
r5   pandas  24000      NaN      2500
r6   Oracle  21000     None      2100
r7     Java  22000   55days      2000

In [86]:
# select rows by index labels

In [87]:
df.loc['r2']

Courses     PySpark
Fee           25000
Duration     40days
Discount       2300
Name: r2, dtype: object

In [88]:
df.loc['r2':'r6']

    Courses    Fee Duration  Discount
r2  PySpark  25000   40days      2300
r3   Hadoop  26000   35days      1500
r4   Python  22000   40days      1200
r5   pandas  24000      NaN      2500
r6   Oracle  21000     None      2100

In [89]:
df.loc['r2':'r6':2]

    Courses    Fee Duration  Discount
r2  PySpark  25000   40days      2300
r4   Python  22000   40days      1200
r6   Oracle  21000     None      2100

In [90]:
df.loc[['r2','r6']]

    Courses    Fee Duration  Discount
r2  PySpark  25000   40days      2300
r6   Oracle  21000     None      2100

In [91]:
df.loc['r2':'r6', 'Fee':'Duration'] # includes the stop value

      Fee Duration
r2  25000   40days
r3  26000   35days
r4  22000   40days
r5  24000      NaN
r6  21000     None

In [92]:
df.loc['r2':'r6', 'Fee']

r2    25000
r3    26000
r4    22000
r5    24000
r6    21000
Name: Fee, dtype: int64

**Rname columns**

In [93]:
technologies = ({
  'Courses':["Spark","PySpark","Hadoop","Python","pandas","Oracle","Java"],
  'Fee' :[20000,25000,26000,22000,24000,21000,22000],
  'Duration':['30day', '40days' ,'35days', '40days', '60days', '50days', '55days']
              })
df = pd.DataFrame(technologies)
df

   Courses    Fee Duration
0    Spark  20000    30day
1  PySpark  25000   40days
2   Hadoop  26000   35days
3   Python  22000   40days
4   pandas  24000   60days
5   Oracle  21000   50days
6     Java  22000   55days

In [94]:
df.columns

Index(['Courses', 'Fee', 'Duration'], dtype='object')

In [95]:
# Rename a Single Column

In [96]:
df.rename(columns = {'Courses':'NewCourses'})

  NewCourses    Fee Duration
0      Spark  20000    30day
1    PySpark  25000   40days
2     Hadoop  26000   35days
3     Python  22000   40days
4     pandas  24000   60days
5     Oracle  21000   50days
6       Java  22000   55days

In [97]:
df

   Courses    Fee Duration
0    Spark  20000    30day
1  PySpark  25000   40days
2   Hadoop  26000   35days
3   Python  22000   40days
4   pandas  24000   60days
5   Oracle  21000   50days
6     Java  22000   55days

In [98]:
df.rename(columns = {'Courses':'NewCourses'}, inplace=True)

In [99]:
df

  NewCourses    Fee Duration
0      Spark  20000    30day
1    PySpark  25000   40days
2     Hadoop  26000   35days
3     Python  22000   40days
4     pandas  24000   60days
5     Oracle  21000   50days
6       Java  22000   55days

In [100]:
df.rename(columns = {'Fee':'FEE', 'Duration':'DURATION'}, inplace=True)

In [101]:
df

  NewCourses    FEE DURATION
0      Spark  20000    30day
1    PySpark  25000   40days
2     Hadoop  26000   35days
3     Python  22000   40days
4     pandas  24000   60days
5     Oracle  21000   50days
6       Java  22000   55days

In [102]:
collist= list(df.columns)
collist

['NewCourses', 'FEE', 'DURATION']

In [103]:
technologies   = ({
    'Courses':["Spark","PySpark","Hadoop","Python","Pandas","Hadoop","Spark","Python","C#"],
    'Fee' :[22000,25000,23000,24000,26000,25000,25000,22000,1500],
    'Duration':['30days','50days','55days','40days','60days','35days','30days','50days','40days'],
    'Discount':[1000,2300,1000,1200,2500,None,1400,1600,0]
          })
df = pd.DataFrame(technologies)
df

   Courses    Fee Duration  Discount
0    Spark  22000   30days    1000.0
1  PySpark  25000   50days    2300.0
2   Hadoop  23000   55days    1000.0
3   Python  24000   40days    1200.0
4   Pandas  26000   60days    2500.0
5   Hadoop  25000   35days       NaN
6    Spark  25000   30days    1400.0
7   Python  22000   50days    1600.0
8       C#   1500   40days       0.0

In [104]:
df.columns

Index(['Courses', 'Fee', 'Duration', 'Discount'], dtype='object')

## Use groupby

In [105]:
# Use groupby() to compute the sum

df2 = df.groupby('Courses').sum()

In [106]:
df2

           Fee      Duration  Discount
Courses
C#        1500        40days       0.0
Hadoop   48000  55days35days    1000.0
Pandas   26000        60days    2500.0
PySpark  25000        50days    2300.0
Python   46000  40days50days    2800.0
Spark    47000  30days30days    2400.0

In [107]:
df2 = df.groupby('Courses', as_index=False).sum()
df2

   Courses    Fee      Duration  Discount
0       C#   1500        40days       0.0
1   Hadoop  48000  55days35days    1000.0
2   Pandas  26000        60days    2500.0
3  PySpark  25000        50days    2300.0
4   Python  46000  40days50days    2800.0
5    Spark  47000  30days30days    2400.0

In [108]:
# Use groupby() to compute the sum of Fee

df2 = df.groupby('Courses', as_index=False)['Fee'].sum()
df2

   Courses    Fee
0       C#   1500
1   Hadoop  48000
2   Pandas  26000
3  PySpark  25000
4   Python  46000
5    Spark  47000

In [109]:
# Use groupby() on 'Courses','Duration' and compute the sum of Fee

df2 = df.groupby(['Courses','Duration'])['Fee'].sum()
df2

Courses  Duration
C#       40days       1500
Hadoop   35days      25000
         55days      23000
Pandas   60days      26000
PySpark  50days      25000
Python   40days      24000
         50days      22000
Spark    30days      47000
Name: Fee, dtype: int64

In [110]:
# Use groupby() on 'Courses','Duration' and compute the max of Fee

df2 = df.groupby(['Courses','Duration'])['Fee'].max()
df2

Courses  Duration
C#       40days       1500
Hadoop   35days      25000
         55days      23000
Pandas   60days      26000
PySpark  50days      25000
Python   40days      24000
         50days      22000
Spark    30days      25000
Name: Fee, dtype: int64

In [111]:
df2 = df.groupby(['Courses','Duration'],as_index=False)['Fee'].count()
df2

   Courses Duration  Fee
0       C#   40days    1
1   Hadoop   35days    1
2   Hadoop   55days    1
3   Pandas   60days    1
4  PySpark   50days    1
5   Python   40days    1
6   Python   50days    1
7    Spark   30days    2